results/routeA/transient_cfd_scaling_pilot/plain_20261006_0710/superseded_cell_reference_attempts/rank_02/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    hotWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       50880;
    }
    coldWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       51040;
    }
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       51200;
    }
    topWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       51360;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          25600;
        startFace       51520;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          25600;
        startFace       77120;
    }
)

// ************************************************************************* //
